In [1]:
import numpy as np
import pandas as pd

In [2]:

# pd.isna(np.nan) =  pd.isnull(np.nan) there same
pd.isnull(np.nan)

True

In [3]:
# pd.notnull(None)
pd.notnull(None)

False

In [4]:
 pd.notnull(7)

True

In [5]:
pd.notnull(pd.Series([1,2,3,4,5,np.nan]))

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [6]:
pd.isnull(pd.Series([1,2,3,4,5,np.nan]))

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [7]:
df =  pd.DataFrame({
    'Column A': [1,np.nan,5],
    'Column B': [np.nan,3,4],
    'Column C': [np.nan,5,np.nan],
    'Column C': [np.nan,5,np.nan],
    'Column D': [5,34,100]
    
})

In [8]:
s = pd.Series([1,2,3,np.nan,np.nan,4])

In [9]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [10]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [11]:
pd.isnull(s).sum()

2

In [12]:
pd.notnull(s).sum()

4

#### How to filter and get all the values different to null  __notnull__() method.

In [13]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

#### How to filter and get all null values to null  __isnull__() method .

In [14]:
s[pd.isnull(s)]

3   NaN
4   NaN
dtype: float64

In [15]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [16]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [17]:
s[s.isnull()]

3   NaN
4   NaN
dtype: float64

In [18]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Short form to drop all the null values using __dropna()__ method

In [19]:
 su = s.dropna()

In [20]:
print(su)

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [21]:
type(su)

pandas.core.series.Series

# I stop at __2:56__ Minutes

In [22]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       NaN       100

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  2 non-null      float64
 2   Column C  1 non-null      float64
 3   Column D  3 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 224.0 bytes

In [24]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       NaN       100

In [38]:
df.isnull().sum()

## this will count the number of nan values and group them per column wise.

## the opposite case is:  df.notnull().sum()

Column A    1
Column B    1
Column C    2
Column D    0
dtype: int64

## retun only the Column which is not contained { NAN } values

In [33]:
df.dropna(axis = 1)

   Column D
0         5
1        34
2       100

### Remove those columns which have more than 1 __nan__ value

In [35]:
df.dropna(thresh = 2, axis ='columns')

   Column A  Column B  Column D
0       1.0       NaN         5
1       NaN       3.0        34
2       5.0       4.0       100

In [27]:
df1  =  pd.DataFrame({
    'Column A': [1,np.nan,5],
    'Column B': [np.nan,3,4],
    'Column C': [np.nan,5,6],
    'Column C': [np.nan,5,7],
    'Column D': [5,34,100]
    
})

## retun only the row  which is not contained { NAN } values

In [28]:
df1.dropna()

   Column A  Column B  Column C  Column D
2       5.0       4.0       7.0       100

In [29]:
df1

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       7.0       100

# How to fix the missing values ? with __fillna()__ method.

### __COLUMNS__ WISE

In [41]:
df1.fillna(10)

# this will replace all nan values to 10

   Column A  Column B  Column C  Column D
0       1.0      10.0      10.0         5
1      10.0       3.0       5.0        34
2       5.0       4.0       7.0       100

In [42]:
df1.fillna(df1.mean())

# this will replace all nan values with the mean() of the corresponding column

   Column A  Column B  Column C  Column D
0       1.0       3.5       6.0         5
1       3.0       3.0       5.0        34
2       5.0       4.0       7.0       100

### Filling nulls with contiguous ( __close__ ) values

In [43]:
df1

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       7.0       100

In [49]:
df1.fillna(method = 'ffill')

## fill the value below

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       1.0       3.0       5.0        34
2       5.0       4.0       7.0       100

In [45]:
adds = df1.fillna(method = 'ffill')

In [48]:
## fill the value above

adds.fillna(method = 'bfill')

   Column A  Column B  Column C  Column D
0       1.0       3.0       5.0         5
1       1.0       3.0       5.0        34
2       5.0       4.0       7.0       100

In [52]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       NaN       100

In [53]:
df.fillna({ 'Column A':0,'Column B':3,'Column C':df['Column C'].mean() })

   Column A  Column B  Column C  Column D
0       1.0       3.0       5.0         5
1       0.0       3.0       5.0        34
2       5.0       4.0       5.0       100

### __Rows__ WISE

### for __{ axis = 0 }__ = Column wise filling

### for __{ axis = 1 }__ = Rows  wise filling

In [54]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       NaN       3.0       5.0        34
2       5.0       4.0       NaN       100

In [56]:

## column wise fill
df.fillna(method = 'ffill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       1.0       3.0       5.0        34
2       5.0       4.0       5.0       100

In [60]:

df.fillna(method = 'ffill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       1.0       1.0       5.0
1       NaN       3.0       5.0      34.0
2       5.0       4.0       4.0     100.0

In [59]:
tt = df.fillna(method = 'ffill', axis = 1)

In [61]:
tt.fillna({ 'Column A':3})

   Column A  Column B  Column C  Column D
0       1.0       1.0       1.0       5.0
1       3.0       3.0       5.0      34.0
2       5.0       4.0       4.0     100.0

## __any()__ and __all()__ methods

In [64]:
bsc1 = pd.Series([False,False,False,False,False])

In [65]:
bsc2 = pd.Series([False,False,False,False,True])

In [66]:
bsc3 = pd.Series([True,True,True,True])

In [69]:
bsc1.any(), bsc1.all()

(False, False)

In [72]:
bsc2.any(), bsc2.all()

(True, False)

In [73]:
bsc3.any(), bsc3.all()

(True, True)